In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv('GDPlist.csv', encoding = 'ISO-8859-1')
data

          Country      Continent  GDP (millions of US$)
0     Afghanistan           Asia                  18181
1         Albania         Europe                  12847
2         Algeria         Africa                 190709
3          Angola         Africa                 100948
4       Argentina  South America                 447644
..            ...            ...                    ...
120    Uzbekistan           Asia                  45353
121     Venezuela  South America                 315841
122       Vietnam           Asia                 122722
123         Yemen         Africa                  33675
124        Zambia         Africa                  19206

[125 rows x 3 columns]

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Country                125 non-null    object
 1   Continent              125 non-null    object
 2   GDP (millions of US$)  125 non-null    int64
dtypes: int64(1), object(2)
memory usage: 3.1+ KB

In [4]:
data.loc[:, ['GDP (millions of US$)']].max()

GDP (millions of US$)    15094025
dtype: int64

In [5]:
data.loc[:, ['GDP (millions of US$)']].min()

GDP (millions of US$)    10600
dtype: int64

In [9]:
data.loc[:, ['GDP (millions of US$)']].median()

GDP (millions of US$)    96089.0
dtype: float64

In [10]:
data.loc[:, ['GDP (millions of US$)']].mode()

     GDP (millions of US$)
0                    10600
1                    11313
2                    12461
3                    12655
4                    12827
..                     ...
120                2776324
121                3577031
122                5869471
123                7298147
124               15094025

[125 rows x 1 columns]

In [11]:
data.loc[:, ['GDP (millions of US$)']].mean()

GDP (millions of US$)    555427.784
dtype: float64

In [12]:
data.describe()

       GDP (millions of US$)
count           1.250000e+02
mean            5.554278e+05
std             1.649266e+06
min             1.060000e+04
25%             2.574200e+04
50%             9.608900e+04
75%             3.332380e+05
max             1.509402e+07

In [13]:
# Dữ liệu phân bố lệch phải

In [14]:
data.loc[:, ['Continent']].mode()

  Continent
0    Europe

In [15]:
data_total_gdp = data.pivot_table(values = 'GDP (millions of US$)', index = 'Continent', aggfunc = 'sum')
data_total_gdp

               GDP (millions of US$)
Continent
Africa                       1820811
Asia                        24425891
Europe                      19139380
North America               18238447
Oceania                      1662727
South America                4141217

In [17]:
data_average_gdp = data.pivot_table(values = 'GDP (millions of US$)', index = 'Continent', aggfunc = 'mean')
data_average_gdp

               GDP (millions of US$)
Continent
Africa                  6.278659e+04
Asia                    6.784970e+05
Europe                  5.172805e+05
North America           1.658041e+06
Oceania                 5.542423e+05
South America           4.601352e+05

In [18]:
data_merge = pd.merge(data_total_gdp, data_average_gdp, on = 'Continent')
data_merge

               GDP (millions of US$)_x  GDP (millions of US$)_y
Continent
Africa                         1820811             6.278659e+04
Asia                          24425891             6.784970e+05
Europe                        19139380             5.172805e+05
North America                 18238447             1.658041e+06
Oceania                        1662727             5.542423e+05
South America                  4141217             4.601352e+05

In [20]:
data_concat = pd.concat([data_total_gdp, data_average_gdp], axis = 1)
data_concat

               GDP (millions of US$)  GDP (millions of US$)
Continent
Africa                       1820811           6.278659e+04
Asia                        24425891           6.784970e+05
Europe                      19139380           5.172805e+05
North America               18238447           1.658041e+06
Oceania                      1662727           5.542423e+05
South America                4141217           4.601352e+05